app/Models/ModelMahasiswa.php

SELECT `tbmahasiswa`.`nim`, `tbmahasiswa`.`nama`, `tbmahasiswa`.`alamat`, `tbmahasiswa`.`jenkel`, `tbjurusan`.`nama_jurusan`, `tbprodi`.`nama_prodi`
FROM `tbmahasiswa`
JOIN `tbjurusan` ON `tbmahasiswa`.`id_jurusan` = `tbjurusan`.`id_jurusan`
JOIN `tbprodi` ON `tbmahasiswa`.`kode_prodi` = `tbprodi`.`kode_prodi`
---
    public function getMahasiswaWithJurusanProdi()
    {
        return $this->db->table($this->table)
            ->select('tbmahasiswa.nim, tbmahasiswa.nama, tbmahasiswa.alamat, tbmahasiswa.jenkel, tbjurusan.nama_jurusan, tbprodi.nama_prodi')
            ->join('tbjurusan', 'tbmahasiswa.id_jurusan = tbjurusan.id_jurusan')
            ->join('tbprodi', 'tbmahasiswa.kode_prodi = tbprodi.kode_prodi')
            ->get()
            ->getResult();